lvx/base/Catalogs/бит_ПрофилиРаспределенияПоПериодам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_ПрофилиРаспределенияПоПериодам</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыПрофилейРаспределения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыДополнительныхАналитик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Профиль</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерПериода</Name>
							<Comment>Номер периода относительно текущего</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Процент</Name>
							<Comment>Процент</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>8</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеАналитики</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

lvx/base/Enums/бит_ВидыПрофилейРаспределения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыПрофилейРаспределения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоПериодам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоАналитике</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

lvx/base/Catalogs/бит_ПрофилиРаспределенияПоПериодам/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс
	
// Функция получает соответствие коэффицентов номерам периодов для профиля.
//
// Параметры:
//  ПрофильРаспределения - СправочникСсылка.бит_ПрофилиРаспределенияПоПериодам - профиль распределения.
//  Режим				 - Строка - режим.
// 
// Возвращаемое значение:
//  Коэффициенты - Соответствие - Значения коэффициентов.
//
Функция ПолучитьКоэффициенты(ПрофильРаспределения, Режим = "П") Экспорт
	
	Коэффициенты = Новый Соответствие;
	Для каждого СтрокаКоэффициент Из ПрофильРаспределения.Профиль Цикл
		
		Коэффициент = ?(Режим = "К", СтрокаКоэффициент.Процент/100, СтрокаКоэффициент.Процент);
		Коэффициенты.Вставить(СтрокаКоэффициент.НомерПериода, Коэффициент);
		
	КонецЦикла; 
	
	Возврат Коэффициенты;
	
КонецФункции

// Процедура заполняет вид профиля распределения.
//
Процедура ЗаполнитьВидПрофиляРаспределенияПриОбновлении() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таблица.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.бит_ПрофилиРаспределенияПоПериодам КАК Таблица
	|ГДЕ
	|	Таблица.Вид = ЗНАЧЕНИЕ(Перечисление.бит_ВидыПрофилейРаспределения.ПустаяСсылка)";	
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ТекущийОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ТекущийОбъект.Вид = Перечисления.бит_ВидыПрофилейРаспределения.ПоПериодам;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ТекущийОбъект);	
	КонецЦикла; 
	
КонецПроцедуры // ЗаполнитьВидПрофиляРаспределенияПриОбновлении()

#КонецОбласти 

#КонецЕсли
